{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faN/Users/mohammedamarnah/Desktop/SDCProject/CBM64-SDC/Steering Control/models.py\u00da\b<lambda>\t\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "activation": "linear", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "W_constraint": null, "nb_filter": 24, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "activation": "linear", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "W_constraint": null, "nb_filter": 36, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "nb_row": 5, "activation": "linear", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "W_constraint": null, "nb_filter": 48, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "activation": "linear", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "W_constraint": null, "nb_filter": 64, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "activation": "linear", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "W_constraint": null, "nb_filter": 64, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1152], "b_regularizer": null, "name": "dense_1", "output_dim": 100, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 1152, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "batch_input_shape": [null, 100], "b_regularizer": null, "name": "dense_2", "output_dim": 50, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 100, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "batch_input_shape": [null, 50], "b_regularizer": null, "name": "dense_3", "output_dim": 10, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 50, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "batch_input_shape": [null, 10], "b_regularizer": null, "name": "dense_4", "output_dim": 1, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 10, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null}}], "keras_version": "1.2.0"}